{
    "about": {
        "cn": {
            "text": "我叫王路远，卡内基梅隆大学电子与计算机工程专业在读研究生。我的研究兴趣包括软件工程、计算机视觉、SLAM 以及机器学习。\n业余时间，我喜欢打羽毛球、滑雪、爬山等运动。我喜欢和朋友出去玩但是很社恐。"
        },
        "i18n": {
            "text": "My name is Luyuan Wang, and I'm pursuing a Master's degree in Electrical and Computer Engineering at Carnegie Mellon University. My research interests include Software Engineering, Computer Vision, SLAM, and Machine Learning. \nI like playing badminton, snowboarding, hiking, and many other sports. I enjoy hanging out with my friends, but I also have a social phobia."
        }
    },
    "resume": {
        "cn": {
            "data": [
                {
                    "labelText": "教育",
                    "descriptionList": [
                        {
                            "title": "卡内基·梅隆大学",
                            "info": "2021.02 - 2023.05",
                            "detailInfo": "硕士研究生就读于卡内基梅隆大学，计算机工程专业。",
                            "imageURL": "https://i.loli.net/2021/05/05/PcBw3p2ejfD7nXq.jpg"
                        },
                        {
                            "title": "密苏里大学 - 哥伦比亚分校",
                            "info": "2018.08 - 2019.06",
                            "detailInfo": "大四在密苏里大学参加校级交流项目，就读于 EECS 学院。主修课程：机器人、嵌入式计算、机器学习、云计算等。GPA 3.88。",
                            "imageURL": "https://i.loli.net/2020/10/07/BS5zWUthe8JrcaP.png"
                        },
                        {
                            "title": "华中科技大学",
                            "info": "2015.09 - 2019.06",
                            "detailInfo": "本科毕业于华中科技大学，电子信息与通信学院，通信工程专业。主修课程：通信原理、数字信号处理、通信电子线路、电磁场与电磁波、微波技术、模拟电路与数字系统等。GPA 3.6。",
                            "imageURL": "https://i.loli.net/2020/10/07/YB2ElRO3Mju4zh9.png"
                        },
                        {
                            "title": "北京一零一中学",
                            "info": "2012.09 - 2015.06",
                            "detailInfo": "高中毕业于北京一零一中学。"
                        }
                    ]
                },
                {
                    "labelText": "学生活动",
                    "descriptionList": [
                        {
                            "title": "冰岩作坊",
                            "info": "2017.03 - 2018.08",
                            "detailInfo": "冰岩作坊（www.bingyan.net）是华中科技大学最具影响力的互联网技术团队之一。我在冰岩作坊期间任 iOS 组组长。",
                            "imageURL": "https://i.loli.net/2020/10/07/4lbNdoGmXzLJPAI.jpg"
                        }
                    ]
                },
                {
                    "labelText": "科研",
                    "descriptionList": [
                        {
                            "title": "卡内基梅隆大学 - 助研",
                            "info": "2021.10 - 今",
                            "detailInfo": "Biorobotics Lab",
                            "imageURL": "https://s2.loli.net/2022/01/14/PHS14mijNVRepbA.png"
                        },
                        {
                            "title": "清华大学 - 助研",
                            "info": "2020.12 - 2021.08",
                            "detailInfo": "在可视化与图形学研究室任助研。",
                            "imageURL": " https://i.loli.net/2020/12/08/n36Leq89B4zftiF.png"
                        },
                        {
                            "title": "密苏里大学 - 助研",
                            "info": "2019.02 - 2019.06",
                            "detailInfo": "在 Video Processing and Communication Lab 任助研。负责开发一个用于探索智能道路可行性的原型系统。",
                            "imageURL": "https://i.loli.net/2020/10/08/gDk56f3HicwxPKN.jpg"
                        }
                    ]
                },
                {
                    "labelText": "工作",
                    "descriptionList": [
                        {
                            "title": "字节跳动",
                            "info": "2019.07 - 2020.12",
                            "detailInfo": "互娱（IES）研发部，iOS 开发工程师。",
                            "imageURL": "https://i.loli.net/2020/10/07/BI7FmuWa3xVifSp.png"
                        },
                        {
                            "title": "腾讯",
                            "info": "2018.06 - 2018.08",
                            "detailInfo": "原腾讯社交网络事业群（SNG）移动客户端开发实习生。",
                            "imageURL": "https://i.loli.net/2020/10/07/9E24wiLcuZaUX65.png"
                        }
                    ]
                },
                {
                    "labelText": "项目经验",
                    "descriptionList": [
                        {
                            "title": "重医助手",
                            "info": "2017.06 - 2017.08",
                            "detailInfo": "“重医助手”是一个独立项目，我一人负责从产品到运营的完整流程。“重医助手”是一款课表类应用，方便重庆医科大学的学生查看课程表、查询成绩。通过爬取重医教务系统获取数据，并存入本地数据库。曾上架 AppStore，下载量 3000+。"
                        },
                        {
                            "title": "背它",
                            "info": "2017.12 - 2018.01",
                            "detailInfo": "“背它”是冰岩作坊的团队项目，我独立负责 iOS 端开发。“背它”是一款小众工具类应用，具有图片记背、文字记背等功能。在项目推广期间，我还负责编写了“背它 Lite”小程序，用于临时的推广活动。已上架 AppStore，下载量 5800+。"
                        },
                        {
                            "title": "蛛网",
                            "info": "2018.03 - 2018.05",
                            "detailInfo": "“蛛网”是冰岩作坊的团队项目，我独立负责 iOS 端开发。“蛛网”是一款内部应用，可以通过日历的形式查看团队活动事项，并编辑参与者。通过 TestFlight 分发。"
                        }
                    ],
                    "jumpURL": "/projects"
                },
                {
                    "labelText": "奖项与荣誉",
                    "descriptionList": [
                        {
                            "title": "最佳冰岩人",
                            "info": "2017",
                            "detailInfo": "“最佳冰岩人”是冰岩作坊内部最高荣誉。"
                        },
                        {
                            "title": "雏鹰计划 铜奖",
                            "info": "2018.06",
                            "detailInfo": "雏鹰计划是原腾讯 SNG 事业群面向实习生举办的小型比赛。我们组实现了一款通过深度学习识别司机情绪，进而提高行车安全性的 App。"
                        },
                        {
                            "title": "中兴捧月杯软件开发大赛 二等奖",
                            "info": "2017",
                            "detailInfo": "实现了一款拍照自动识别车牌号的 App，目的是方便学校保卫处处理违规停车行为。团队共 2 人，我负责 iOS 端开发，另一人负责服务器端开发。此项目同时获得“武汉大学移动应用设计大赛”二等奖。"
                        },
                        {
                            "title": "种子杯编程大赛 优胜奖",
                            "info": "2017",
                            "detailInfo": "通过机器学习技术，预测 NBA 比赛结果。"
                        }
                    ]
                },
                {
                    "labelText": "技术栈",
                    "descriptionList": [
                        {
                            "title": "编程语言",
                            "info": "",
                            "detailInfo": "熟悉：Swift/C/Objective-C\n了解: Java/C++/Python/Matlab/JavaScript/SQL\n接触过：Dart/Lua/ASM/Verilog/Bash"
                        },
                        {
                            "title": "技术、技能及框架",
                            "info": "",
                            "detailInfo": "熟悉：iOS 应用开发\n了解：Web 前端（React）/Web 后端（Django）/嵌入式系统（Arduino，Raspberry-Pi，嵌入式 Linux）/机器人（ROS，V-REP）/图像处理/人工智能（ML，CI） \n接触过：Flutter/MySQL/Android/微信小程序"
                        }
                    ]
                }
            ]
        },
        "i18n": {
            "data": [
                {
                    "labelText": "Education",
                    "descriptionList": [
                        {
                            "title": "Carnegie Mellon University",
                            "info": "2021.02 - 2023.05",
                            "detailInfo": "Master's Degree, Electrical and Computer Engineering.",
                            "imageURL": "https://i.loli.net/2021/05/05/PcBw3p2ejfD7nXq.jpg"
                        },
                        {
                            "title": "University of Missouri - Columbia",
                            "info": "2018.08 - 2019.06",
                            "detailInfo": "I spent my last undergraduate year at University of Missouri - Columbia, as an exchange student. I took 8 courses, and 4 of them were chosen as graduate level. Those courses include Building Intelligent Robots, Machine Learning, Real-time Embedded Computing and so on. My overall GPA was 3.88.",
                            "imageURL": "https://i.loli.net/2020/10/07/BS5zWUthe8JrcaP.png"
                        },
                        {
                            "title": "Huazhong University of Science and Technology",
                            "info": "2015.09 - 2019.06",
                            "detailInfo": "I got my bachelor's degree at Huazhong University of Science and Technology (HUST), Wuhan, China. My major was Telecommunication Engineering. The main courses include Information Theory, Digital Signal Processing, Analog Circuits and Digital Systems, Computer Networks, Electromagnetic Filed and Electromagnetic Waves, and so on. My overall GPA at HUST was 3.6.",
                            "imageURL": "https://i.loli.net/2020/10/07/YB2ElRO3Mju4zh9.png"
                        }
                    ]
                },
                {
                    "labelText": "Work Experience",
                    "descriptionList": [
                        {
                            "title": "ByteDance - Software Engineer",
                            "info": "2019.07 - 2020.12",
                            "detailInfo": "I joined ByteDance since July 2019. I took part in new feature development, bug fixing, and code refactoring for Douyin (Huoshan version) and Vigo Video.",
                            "imageURL": "https://i.loli.net/2020/10/07/BI7FmuWa3xVifSp.png"
                        },
                        {
                            "title": "Tencent - Software Engineer Intern",
                            "info": "2018.06 - 2018.08",
                            "detailInfo": "Tencent is one of the biggest and most well-known internet company in China. My position was software R&D intern.",
                            "imageURL": "https://i.loli.net/2020/10/07/9E24wiLcuZaUX65.png"
                        }
                    ]
                },
                {
                    "labelText": "Research",
                    "descriptionList": [
                        {
                            "title": "Biorobotics Lab - Research Assistant",
                            "info": "2021.10 - Present",
                            "detailInfo": "Currently working on ARPA-E CMU Mapping project.",
                            "imageURL": "https://s2.loli.net/2022/01/14/PHS14mijNVRepbA.png"
                        },
                        {
                            "title": "VIS Lab - Research Assistant",
                            "info": "2020.12 - 2021.08",
                            "detailInfo": "I worked at the Visualization and Graphics Laboratory, Tsinghua University, as a research assistant.",
                            "imageURL": " https://i.loli.net/2020/12/08/n36Leq89B4zftiF.png"
                        },
                        {
                            "title": "VPC Lab - Research Assistant",
                            "info": "2019.02 - 2019.06",
                            "detailInfo": "I worked at the Video Processing and Communication Lab, University of Missouri, as an undergraduate research assistant. My job was to develop a prototype in order to explore the feasibility of vision-guided autonomous driving. I designed and developed the entire software system and a part of the hardware system.",
                            "imageURL": "https://i.loli.net/2020/10/08/gDk56f3HicwxPKN.jpg"
                        }             
                    ]
                },
                {
                    "labelText": "Student Activities",
                    "descriptionList": [
                        {
                            "title": "Bingyan Studio",
                            "info": "2017.03 - 2019.06",
                            "detailInfo": "Bingyan Studio (www.bingyan.net) is one of the most influential student technical team at HUST. I was the leader of the iOS group, mainly in charge of recruitment & interviews,  technical training & sharing, and lead the team to develop iOS Apps.",
                            "imageURL": "https://i.loli.net/2020/10/07/4lbNdoGmXzLJPAI.jpg"
                        }
                    ]
                },
                {
                    "labelText": "Projects",
                    "descriptionList": [
                        {
                            "title": "CQMU Schedule",
                            "info": "2017.06 - 2017.08",
                            "detailInfo": "CQMU Schedule is a mobile App that developed for students at ChongQing Medical University. After getting the access permission from the student, this App can automatically log in to the university's teaching management website and download course schedule, scores of each exam, and many other useful information. All this information is stored in a local database and can be present in a clear and handy way. As everything happens right within the App, there is no risk of password leaking or other privacy issues. As it is much easier to use than the original official website, I got tens of thanks letters, and I'm super proud of that."
                        },
                        {
                            "title": "Fuzzy Navigation System for Mobile Robots",
                            "info": "2018.11 - 2018.12",
                            "detailInfo": "This is a navigation system that can guide a mobile robot moving to the desired destination without hitting into obstacles. To test the system, we first build a simple simulation environment using Python. The simulator can allow us to put different shapes of obstacles and tell the robot the readings of its virtual sensors. Then, we use Fuzzy Logic to teach the robot some basic fuzzy rules, for example, \"If the obstacle is close to the left, then turn right for a little bit\". The outputs of the fuzzy engine are defuzzified and used to drive the robot."
                        }
                    ],
                    "jumpURL": "/projects"
                },
                {
                    "labelText": "Technology Stack",
                    "descriptionList": [
                        {
                            "title": "Programming Languages",
                            "info": "",
                            "detailInfo": "Proficient in：Swift / Java / C / C++ / Objective-C\nFamiliar with: Python / Matlab / JavaScript / SQL ..."
                        },
                        {
                            "title": "Technologies",
                            "info": "",
                            "detailInfo": "Proficient in: Mobile App Development\nFamiliar with: Web Front-end Design / Web Back-end Design / Robotics / Embedded Systems / Computer Vision / Machine Learning / Signal Processing / Communication Systems..."
                        }
                    ]
                }
            ]
        }
    },
    "project": {
        "data": [
            {
                "title": "Smart Road System",
                "imageSrc": "images/smart_road_0.jpg",
                "detail": "This project is an early prototype of a smart road system. There are 4 cameras that cover the whole lab. Each camera is connected to a computer. Using image processing, I can precisely detect the position of the front point and the end point of a car in the image frame. As the cameras are calibrated, those positions can be converted into the world frame. Thus the 3D position and orientation of a given car can be calculated.\nTo control the mini-car through the Wi-Fi network, we replace the built-in remote controller with Raspberry-Pi. PWM waves are generated and control the servo motor and the DC motor. The 4 computers share information through the Ethernet network, and each of them has a separate Wi-Fi network card and acts as a small base station. To make the mini-car able to roam across different base stations, the network card on the mini-car works in a connectionless way.\nThe lane-keeping controller is a PID controller. Given the position and status of a mini-car, we can calculate a virtual target position. As the car is moving, the virtual target is also moving. So, the car can run along the lane stably.\nWe use ROS as our inter-computers communication framework. As all the information is transmitting through ROS, we use Rviz to visualize the status of the system, which is pretty helpful for debugging.\nI designed and implemented the entire software system, as well as part of the hardware system."
            },
            {
                "title": "A Hand Gesture Recognizer based on Machine Learning",
                "imageSrc": "images/gesture_ml.jpg",
                "detail": "We use HOG, LBP and skin color as the key features. To get a better performance, PCA is used to reduce the dimension. \nIn order to detect the position of the hand, we use 3 different sizes of sliding windows to scan the image. Then, a heat-map is generated and the \"hottest\" location is most likely represent hand.\nThe sub-image is then fed into the next classifier to classify gestures. 5 different gestures can be recognized, including open-hand, thumb-up, and so on. As you can see, the gesture recognizer is able to tell both the position and the gesture class in a relatively complicated image.\nInstead of download training sets from the Internet, we collect hundreds of images by ourselves."
            },
            {
                "title": "LLVM Loop Optimization Comparison",
                "imageSrc": "images/loop_opt.png",
                "detail": "In this project, I wrote 4 simple C programs, and use Clang with LLVM to compile them with different options. The generated LLVM IR code before and after optimization are compared. The gem5 simulator is used to analyze the time consumption and the cache miss rate. Finally, these optimization techniques are applied to Polybench to make comparisons."
            },
            {
                "title": "Tip-over Prevention for Mobile Robots",
                "imageSrc": "images/tipover.jpg",
                "detail": "By controlling the heavy manipulator installed on the mobile robot, the Center of Gravity (CoG) can be adjusted. Thus, the stability of the robot can be improved. In this project, I implemented an algorithm to read the IMU sensors and calculate the ideal pose of the robot. The algorithm is tested and verified with V-REP simulator. The simulating code is written in Lua, and the controller program is implemented in Matlab."
            },
            {
                "title": "Course Project of Building Intelligent Robot",
                "imageSrc": "images/arm_robot.jpg",
                "detail": "There are 3 PUMA robots and 1 mobile robot. The binocular camera system can detect the position of black cylinders, and guide the PUMA robot arm to pick up and place them on the mobile robot. The mobile robot can localize itself by recognizing AR markers, and navigate to the next position. It can also use infrared sensors to detect and avoid obstacles. All these robots communicate with each other through ROS."
            },
            {
                "title": "Club Management System",
                "imageSrc": "images/club_web.jpg",
                "detail": "The system has multiple functions including project, budget, and team members managements. The front-end is implemented with React.js, and the back-end is realized with Django. The database is MySQL."
            },
            {
                "title": "Coroutine Scheduler",
                "imageSrc": "images/co_scheduler.jpg",
                "detail": "Implemented a coroutine library and its scheduler in C. In order to control the registers while a function is being called, the Assembly language is also used. Each coroutine task has the ability to call blocking functions, such as 'sleep' without freezing the whole system. The outputs from each task are transferred to a named pipe to display in another terminal. This project is originally designed for Linux. Then, after fixed a byte alignment problem, it can also run on macOS, as macOS has additional constraints."
            },
            {
                "title": "Robotic Goalkeeper",
                "imageSrc": "images/car_ball.jpg",
                "detail": "Used a camera to detect the rolling tennis ball and predict its track. After the cross point is calculated, commands will be sent to the car-like robot to catch the ball through Bluetooth. The core controller is designed with GUI to visualize the system status."
            },
            {
                "title": "Beita App",
                "imageSrc": "images/beta.jpg",
                "detail": "An app that can help students memorize course materials easier. You can either copy and paste your documents, or use the camera to scan it. This app support user-friendly gesture operations, so selecting the important paragraphs is really easy."
            },
            {
                "title": "Cobweb App",
                "imageSrc": "images/zhuwang.jpg",
                "detail": "An internal team management tool for Bingyan Studio."
            },
            {
                "title": "A Wireless Communication System with Pluto SDR",
                "imageSrc": "images/pluto.jpg",
                "detail": "Used Pluto SDR to implement a simple wireless communication system. Realized two communication protocols to support reliable communication: stop-and-wait & sliding window. This system can transmit texts or arbitrary files."
            },
            {
                "title": "Ultrasonic Somatosensory Game",
                "imageSrc": "images/vga_game.jpg",
                "detail": "By changing the distance with your hand and the sensor, players can control the distance between the two read squares. Your job is preventing those squares from hitting the blue bars. The higher scores you got, the faster the bars move. We used a FPGA board (with a IP Core installed) to read the ultrasonic sensor and control the VGA display."
            }
        ]
    }
}